{ "type": "success", "value": [ { "id": 205, "joke": "It is scientifically impossible for Chuck Norris to have had a mortal father. The most popular theory is that he went back in time and fathered himself.", "categories": [] }, { "id": 186, "joke": "Fear is not the only emotion Chuck Norris can smell. He can also detect hope, as in &quot;I hope I don't get a roundhouse kick from Chuck Norris.&quot;", "categories": [] }, { "id": 567, "joke": "Code runs faster when Chuck Norris watches it.", "categories": ["nerdy"] }, { "id": 286, "joke": "The square root of Chuck Norris is pain. Do not try to square Chuck Norris, the result is death.", "categories": [] }, { "id": 515, "joke": "Chuck Norris compresses his files by doing a flying round house kick to the hard drive.", "categories": ["nerdy"] }, { "id": 312, "joke": "Jesus can walk on water, but Chuck Norris can walk on Jesus.", "categories": [] }, { "id": 47, "joke": "There is no theory of evolution, just a list of creatures Chuck Norris allows to live.", "categories": [] }, { "id": 170, "joke": "Wo hu cang long. The translation from Mandarin Chinese reads: &quot;Crouching Chuck, Hidden Norris&quot;", "categories": [] }, { "id": 417, "joke": "According to the Bible, God created the universe in six days. Before that, Chuck Norris created God by snapping his fingers.", "categories": [] }, { "id": 368, "joke": "Chuck Norris has to register every part of his body as a separate lethal weapon. His spleen is considered a concealed weapon in over 50 states.", "categories": [] }, { "id": 406, "joke": "Chuck Norris doesn't say &quot;who's your daddy&quot;, because he knows the answer.", "categories": [] }, { "id": 251, "joke": "Kryptonite has been found to contain trace elements of Chuck Norris roundhouse kicks to the face. This is why it is so deadly to Superman.", "categories": [] }, { "id": 475, "joke": "Chuck Norris doesn't need sudo, he just types &quot;Chuck Norris&quot; before his commands.", "categories": ["nerdy"] }, { "id": 461, "joke": "Chuck Norris finished World of Warcraft.", "categories": ["nerdy"] }, { "id": 298, "joke": "MacGyver immediately tried to make a bomb out of some Q-Tips and Gatorade, but Chuck Norris roundhouse-kicked him in the solar plexus. MacGyver promptly threw up his own heart.", "categories": [] }, { "id": 433, "joke": "In ancient China there is a legend that one day a child will be born from a dragon, grow to be a man, and vanquish evil from the land. That man is not Chuck Norris, because Chuck Norris killed that man.", "categories": [] }, { "id": 160, "joke": "Along with his black belt, Chuck Norris often chooses to wear brown shoes. No one has DARED call him on it. Ever.", "categories": [] }, { "id": 233, "joke": "When Bruce Banner gets mad, he turns into the Hulk. When the Hulk gets mad, he turns into Chuck Norris.", "categories": [] }, { "id": 137, "joke": "Tom Clancy has to pay royalties to Chuck Norris because &quot;The Sum of All Fears&quot; is the name of Chuck Norris' autobiography.", "categories": [] }, { "id": 511, "joke": "Every SQL statement that Chuck Norris codes has an implicit &quot;COMMIT&quot; in its end.", "categories": ["nerdy"] }, { "id": 508, "joke": "Chuck Norris doesn't need an OS.", "categories": ["nerdy"] }, { "id": 418, "joke": "Chuck Norris doesn't believe in ravioli. He stuffs a live turtle with beef and smothers it in pig's blood.", "categories": [] }, { "id": 109, "joke": "It takes Chuck Norris 20 minutes to watch 60 Minutes.", "categories": [] }, { "id": 107, "joke": "Chuck Norris doesn't bowl strikes, he just knocks down one pin and the other nine faint.", "categories": [] }, { "id": 267, "joke": "Ozzy Osbourne bites the heads off of bats. Chuck Norris bites the heads off of Siberian Tigers.", "categories": [] }, { "id": 204, "joke": "Nagasaki never had a bomb dropped on it. Chuck Norris jumped out of a plane and punched the ground", "categories": [] }, { "id": 283, "joke": "The only sure things are Death and Taxes?and when Chuck Norris goes to work for the IRS, they'll be the same thing.", "categories": [] }, { "id": 467, "joke": "Chuck Norris can delete the Recycling Bin.", "categories": ["nerdy"] }, { "id": 510, "joke": "Chuck Norris can compile syntax errors.", "categories": ["nerdy"] }, { "id": 300, "joke": "Chuck Norris eats steak for every single meal. Most times he forgets to kill the cow.", "categories": [] }, { "id": 456, "joke": "All browsers support the hex definitions #chuck and #norris for the colors black and blue.", "categories": ["nerdy"] }, { "id": 78, "joke": "The grass is always greener on the other side, unless Chuck Norris has been there. In that case the grass is most likely soaked in blood and tears.", "categories": [] }, { "id": 293, "joke": "70% of a human's weight is water. 70% of Chuck Norris' weight is his dick.", "categories": ["explicit"] }, { "id": 491, "joke": "Chuck Norris doesn't use reflection, reflection asks politely for his help.", "categories": ["nerdy"] }, { "id": 72, "joke": "How much wood would a woodchuck chuck if a woodchuck could Chuck Norris? All of it.", "categories": [] }, { "id": 74, "joke": "In honor of Chuck Norris, all McDonald's in Texas have an even larger size than the super-size. When ordering, just ask to be Chucksized.", "categories": [] }, { "id": 230, "joke": "Chuck Norris built a time machine and went back in time to stop the JFK assassination. As Oswald shot, Chuck met all three bullets with his beard, deflecting them. JFK's head exploded out of sheer amazement.", "categories": [] }, { "id": 156, "joke": "There is no such thing as global warming. Chuck Norris was cold, so he turned the sun up.", "categories": [] }, { "id": 339, "joke": "Think of a hot woman. Chuck Norris did her.", "categories": [] }, { "id": 387, "joke": "For Spring Break '05, Chuck Norris drove to Madagascar, riding a chariot pulled by two electric eels.", "categories": [] }, { "id": 291, "joke": "Chuck Norris never wet his bed as a child. The bed wet itself out of fear.", "categories": [] }, { "id": 163, "joke": "Ninjas want to grow up to be just like Chuck Norris. But usually they grow up just to be killed by Chuck Norris.", "categories": [] }, { "id": 278, "joke": "They had to edit the first ending of 'Lone Wolf McQuade' after Chuck Norris kicked David Carradine's ass, then proceeded to barbecue and eat him.", "categories": [] }, { "id": 280, "joke": "When Chuck Norris works out on the Total Gym, the Total Gym feels like it's been raped.", "categories": [] }, { "id": 185, "joke": "If Chuck Norris were a calendar, every month would be named Chucktober, and every day he'd kick your ass.", "categories": [] }, { "id": 150, "joke": "Superman once watched an episode of Walker, Texas Ranger. He then cried himself to sleep.", "categories": [] }, { "id": 375, "joke": "After taking a steroids test doctors informed Chuck Norris that he had tested positive. He laughed upon receiving this information, and said &quot;of course my urine tested positive, what do you think they make steroids from?&quot;", "categories": [] }, { "id": 498, "joke": "Chuck Norris hosting is 101% uptime guaranteed.", "categories": ["nerdy"] }, { "id": 67, "joke": "A Chuck Norris-delivered Roundhouse Kick is the preferred method of execution in 16 states.", "categories": [] }, { "id": 66, "joke": "Chuck Norris can't finish a &quot;color by numbers&quot; because his markers are filled with the blood of his victims. Unfortunately, all blood is dark red.", "categories": [] }, { "id": 329, "joke": "There are only two things that can cut diamonds: other diamonds, and Chuck Norris.", "categories": [] }, { "id": 86, "joke": "Wilt Chamberlain claims to have slept with more than 20,000 women in his lifetime. Chuck Norris calls this &quot;a slow Tuesday.&quot;", "categories": [] }, { "id": 507, "joke": "Chuck Norris can install iTunes without installing Quicktime.", "categories": ["nerdy"] }, { "id": 412, "joke": "Chuck Norris knows the last digit of pi.", "categories": ["nerdy"] }, { "id": 310, "joke": "182,000 Americans die from Chuck Norris-related accidents every year.", "categories": [] }, { "id": 4, "joke": "If you ask Chuck Norris what time it is, he always answers &quot;Two seconds till&quot;. After you ask &quot;Two seconds to what?&quot;, he roundhouse kicks you in the face.", "categories": [] }, { "id": 90, "joke": "Chuck Norris always knows the EXACT location of Carmen SanDiego.", "categories": [] }, { "id": 522, "joke": "Chuck Norris can do a wheelie on a unicycle.", "categories": [] }, { "id": 288, "joke": "To be or not to be? That is the question. The answer? Chuck Norris.", "categories": [] }, { "id": 527, "joke": "No one has ever spoken during review of Chuck Norris' code and lived to tell about it.", "categories": ["nerdy"] }, { "id": 400, "joke": "Chuck Norris' dick is so big, it has it's own dick, and that dick is still bigger than yours.", "categories": ["explicit"] }, { "id": 104, "joke": "If you Google search &quot;Chuck Norris getting his ass kicked&quot; you will generate zero results. It just doesn't happen.", "categories": [] }, { "id": 134, "joke": "Using his trademark roundhouse kick, Chuck Norris once made a fieldgoal in RJ Stadium in Tampa Bay from the 50 yard line of Qualcomm stadium in San Diego.", "categories": [] }, { "id": 2, "joke": "MacGyver can build an airplane out of gum and paper clips. Chuck Norris can kill him and take it.", "categories": [] }, { "id": 352, "joke": "Chuck Norris doesn't see dead people. He makes people dead.", "categories": [] }, { "id": 225, "joke": "Chuck Norris is the reason why Waldo is hiding.", "categories": [] }, { "id": 564, "joke": "Chuck Norris can download emails with his pick-up.", "categories": ["nerdy"] }, { "id": 70, "joke": "Chuck Norris' house has no doors, only walls that he walks through.", "categories": [] }, { "id": 126, "joke": "When Chuck Norris does a pushup, he isn't lifting himself up, he's pushing the Earth down.", "categories": [] }, { "id": 50, "joke": "Chuck Norris invented Kentucky Fried Chicken's famous secret recipe with eleven herbs and spices. Nobody ever mentions the twelfth ingredient: Fear.", "categories": [] }, { "id": 23, "joke": "Time waits for no man. Unless that man is Chuck Norris.", "categories": [] }, { "id": 199, "joke": "When Chuck Norris says &quot;More cowbell&quot;, he MEANS it.", "categories": [] }, { "id": 57, "joke": "Chuck Norris is ten feet tall, weighs two-tons, breathes fire, and could eat a hammer and take a shotgun blast standing.", "categories": [] }, { "id": 530, "joke": "Chuck Norris can dereference NULL.", "categories": ["nerdy"] }, { "id": 235, "joke": "Chuck Norris once kicked a horse in the chin. Its decendants are known today as Giraffes.", "categories": [] }, { "id": 449, "joke": "All arrays Chuck Norris declares are of infinite size, because Chuck Norris knows no bounds.", "categories": ["nerdy"] }, { "id": 344, "joke": "Aliens DO indeed exist. They just know better than to visit a planet that Chuck Norris is on.", "categories": [] }, { "id": 489, "joke": "Chuck Norris can write multi-threaded applications with a single thread.", "categories": ["nerdy"] }, { "id": 435, "joke": "When you play Monopoly with Chuck Norris, you do not pass go, and you do not collect two hundred dollars. You will be lucky if you make it out alive.", "categories": [] }, { "id": 77, "joke": "Chuck Norris can divide by zero.", "categories": [] }, { "id": 214, "joke": "As President Roosevelt said: &quot;We have nothing to fear but fear itself. And Chuck Norris.&quot;", "categories": [] }, { "id": 548, "joke": "Product Owners never argue with Chuck Norris after he demonstrates the DropKick feature.", "categories": ["nerdy"] }, { "id": 257, "joke": "Chuck Norris doesnt wear a watch, HE decides what time it is.", "categories": [] }, { "id": 325, "joke": "Every time someone uses the word &quot;intense&quot;, Chuck Norris always replies &quot;you know what else is intense?&quot; followed by a roundhouse kick to the face.", "categories": [] }, { "id": 162, "joke": "Once you go Norris, you are physically unable to go back.", "categories": [] }, { "id": 29, "joke": "Teenage Mutant Ninja Turtles is based on a true story: Chuck Norris once swallowed a turtle whole, and when he crapped it out, the turtle was six feet tall and had learned karate.", "categories": [] }, { "id": 285, "joke": "With the rising cost of gasoline, Chuck Norris is beginning to worry about his drinking habit.", "categories": [] }, { "id": 65, "joke": "When Chuck Norris was denied an Egg McMuffin at McDonald's because it was 10:35, he roundhouse kicked the store so hard it became a Wendy's.", "categories": [] }, { "id": 188, "joke": "MacGyver can build an airplane out of gum and paper clips, but Chuck Norris can roundhouse-kick his head through a wall and take it.", "categories": [] }, { "id": 71, "joke": "When Chuck Norris has sex with a man, it won't be because he is gay. It will be because he has run out of women.", "categories": ["explicit"] }, { "id": 236, "joke": "Sticks and stones may break your bones, but a Chuck Norris glare will liquefy your kidneys.", "categories": [] }, { "id": 287, "joke": "Chuck Norris' testicles do not produce sperm. They produce tiny white ninjas that recognize only one mission: seek and destroy.", "categories": [] }, { "id": 80, "joke": "Newton's Third Law is wrong: Although it states that for each action, there is an equal and opposite reaction, there is no force equal in reaction to a Chuck Norris roundhouse kick.", "categories": [] }, { "id": 442, "joke": "Everything King Midas touches turnes to gold. Everything Chuck Norris touches turns up dead.", "categories": [] }, { "id": 531, "joke": "Jesus can walk on water, but Chuck Norris can swim through land.", "categories": [] }, { "id": 318, "joke": "If you work in an office with Chuck Norris, don't ask him for his three-hole-punch.", "categories": [] }, { "id": 223, "joke": "Chuck Norris smells what the Rock is cooking... because the Rock is Chuck Norris' personal chef.", "categories": [] }, { "id": 155, "joke": "Chuck Norris does not &quot;style&quot; his hair. It lays perfectly in place out of sheer terror.", "categories": [] }, { "id": 350, "joke": "Chuck Norris starts everyday with a protein shake made from Carnation Instant Breakfast, one dozen eggs, pure Colombian cocaine, and rattlesnake venom. He injects it directly into his neck with a syringe.", "categories": [] }, { "id": 378, "joke": "There are no such things as tornados. Chuck Norris just hates trailer parks.", "categories": [] } ]  }
